{"inkVersion":21,"root":[["^Dans un monde où être un Rangers n’est qu’un boulot mal payé, tirant parti de l’image des Fighter Rangers après qu’ils aient défait la dernière menace cosmique, Yuuki lui enfile chaque jour son costume vert et enchaîne les missions sans grande importance.","\n","^Mais un jour, alors qu’une prise d’otage à lieux dans une banque où il effectue une mission, les malfrats ne vérifient pas les toilettes et c’est alors au Ranger Vert Yuuki de sauver la situation, de devenir un véritable Fighter Ranger.","\n",{"->":"Commencer"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"Commencer":[["ev","str","^Commencer.","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":"Debut"},{"#f":5}]}],{"#f":1}],"Debut":[["^Alors que Yuuki termine de vider sa vessie, il entend du grabuge à l'extérieur, puis plus un bruit, des pas s'approche de la porte et en regardant au-dessus de celle-ci, il aperçoit un homme cagoulé, armé d'un pistolet. C'est un braquage, une prise d'otage même.","\n","ev","str","^Yuuki attaque le braqueur par-derrière.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Yuuki attend que le braqueur sorte de la pièce pour en sortir à son tour.","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n",{"->":"GameOver1"},{"#f":5}],"c-1":["\n",{"->":"BonChoix1"},{"#f":5}]}],{"#f":1}],"GameOver1":["^Yuuki sort alors discrètement de sa cabine de toilette et se jette sur le braqueur. Le braqueur l'avait vu dans le miroir.","\n","^Yuuki tente alors de se battre, mais impossible, le braqueur est bien plus fort et résistant que lui, Yuuki se fait assommer et est emmené avec les autres otages.","\n",{"->":"Recommencer"},{"#f":1}],"BonChoix1":[["^Une fois sortie des toilettes, Yuuki regarde autour de lui et réfléchit. Il peut se rendre à la salle de surveillance, sonner l'alarme silencieuse et repérer les positions des braqueurs, ou il peut se rendre au local technique, il y aura sûrement de quoi se défendre là-bas.","\n","ev","str","^Yuuki se rend à la salle de surveillance.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Yuuki se rend au local technique.","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n",{"->":"BonChoix2"},{"#f":5}],"c-1":["\n",{"->":"GameOver2"},{"#f":5}]}],{"#f":1}],"GameOver2":[["^Alors que Yuuki réussis à atteindre le local sans soucis, lorsqu'il ouvre la porte celle-ci tape dans un balai qui tombe au sol dans un bruit sourd. Ce bruit alerte les braqueurs, deux d'entre eux rappliquent.","\n","ev","str","^Yuuki ramasse le balai et se prépare à se battre.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Yuuki accepte son sort et se rend.","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n",{"->":"GameOver2v1"},{"#f":5}],"c-1":["\n",{"->":"GameOver2v2"},{"#f":5}]}],{"#f":1}],"GameOver2v1":["^Lorsque les braqueurs arrivent au niveau du Ranger vert, ceux-ci sont armés de pistolet, aucune chance de remporter ce combat. Yuuki se fait alors aisément maîtriser et est emmené avec les autres otages.","\n",{"->":"Recommencer"},{"#f":1}],"GameOver2v2":["^Ayant entendu deux personnes arrivées dans sa direction, Yuuki ne cherche pas à résister et se rend.","\n",{"->":"Recommencer"},{"#f":1}],"BonChoix2":[["^Ayant réussi a esquiver tous les dangers et entrer dans la salle de surveillance, Yuuki peut alors appuyer sur le bouton rouge et sonner l'alarme silencieuse pour prévenir les autorités.","\n","^Autour de lui, se trouve plusieurs écrans de surveillance, un grand placard qui semble vide et une clef électronique, pouvant donner accès à toutes les pièces de la banque. Mais soudain il entend des pas qui semblent se diriger vers la salle de surveillance.","\n","ev","str","^Yuuki se cache dans le placard vide.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Yuuki sort de la pièce et court.","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n",{"->":"BonChoix3"},{"#f":5}],"c-1":["\n",{"->":"GameOver3"},{"#f":5}]}],{"#f":1}],"GameOver3":["^En sortant de la pièce, le ranger vert percute un braqueur et tombe au sol. Le voilà forcé de se rendre.","\n",{"->":"Recommencer"},{"#f":1}],"BonChoix3":[["^Alors que le Ranger Vert se cache, le braqueur entre dans la pièce et vérifie les caméras. Il y reste quelques minutes.","\n","ev","str","^Yuuki sort de sa cachette casque en main et assomme le braqueur.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Yuuki reste caché.","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n",{"->":"BonChoix4"},{"#f":5}],"c-1":["\n",{"->":"BonChoix5"},{"#f":5}]}],{"#f":1}],"BonChoix4":[["^Le braqueur s'écroule. Yuuki lui attache les mains avec ce qu'il trouve et l'enferme dans le placard où il était caché auparavant.","\n","ev","str","^Yuuki regarde les caméras de surveillance.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Yuuki prend la carte d'accès et sort de la pièce.","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n",{"->":"BonChoix6"},{"#f":5}],"c-1":["\n",{"->":"GameOver4"},{"#f":5}]}],{"#f":1}],"BonChoix5":[["^Après quelques minutes, le braqueur s'en va et Yuuki sort enfin de sa cachette, reprenant son souffle après s'être retenu si longtemps.","\n","ev","str","^Yuuki regarde les caméras de surveillance.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Yuuki prend la carte d'accès et sort de la pièce.","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n",{"->":"BonChoix6"},{"#f":5}],"c-1":["\n",{"->":"GameOver4"},{"#f":5}]}],{"#f":1}],"GameOver4":["^Yuuki sort alors de la salle de surveillance, sans avoir vérifié les caméras, et le voilà qui percute un autre braqueur. Le braqueur tombe sur les fesses, Yuuki également. Ils se relèvent et se battent, mais Yuuki ne fait pas le poids, il est trop frêle.","\n",{"->":"Recommencer"},{"#f":1}],"BonChoix6":[["^Le garçon se penche sur les écrans et observe alors. Un braqueur dans le couloir vient de passer devant la salle de surveillance, il se dirige vers le hall où se trouvent les otages et un autre braqueur. Un autre est dans le coffre-fort, volant l'argent.","\n","^Un autre braqueur se trouve sur le balcon intérieur, celui qui donne sur le hall précédemment vu.","\n","ev","str","^Yuuki prend la clef électronique et se rend au coffre-fort.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Yuuki décide de se débarrasser du braqueur dans le couloir.","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n",{"->":"BonChoix7"},{"#f":5}],"c-1":["\n",{"->":"GameOver5"},{"#f":5}]}],{"#f":1}],"BonChoix7":[["^Arrivant discrètement devant la porte du coffre-fort, Yuuki la pousse de toutes ses forces et réussi à enfermer le braqueur qui était à l'intérieur. Il peut désormais passer à la suite.","\n","ev","str","^Yuuki se rend à l'étage discrètement.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Yuuki décide de se débarrasser du braqueur dans le couloir.","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n",{"->":"BonChoix8"},{"#f":5}],"c-1":["\n",{"->":"GameOver5"},{"#f":5}]}],{"#f":1}],"GameOver5":["^Il se rend discrètement derrière le braqueur qui faisait sa ronde. Yuuki le frappe à l'aide de son casque et celui-ci s'évanouit, mais c'était malheureusement trop proche du hall, son partenaire voit Yuuki et le pointe de son arme. Yuuki se rend.","\n",{"->":"Recommencer"},{"#f":1}],"BonChoix8":[["^Yuuki monte donc à l'étage et se rend dans le bureau du grand patron, pour accéder au balcon ou est perché le braqueur. Il regarde autour de lui, à la recherche d'un objet pouvant l'aider. Il aperçoit une queue de billard, un énorme trophée de golf, son bon vieux casque de Ranger Vert et un verre à whisky.","\n","ev","str","^Yuuki prend la queue de billard.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Yuuki prend le trophée.","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Yuuki prend son casque.","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Yuuki prend le verre à whisky.","/str","/ev",{"*":".^.c-3","flg":4},{"c-0":["\n",{"->":"GameOver6"},{"#f":5}],"c-1":["\n",{"->":"GameOver7"},{"#f":5}],"c-2":["\n",{"->":"BonChoix9"},{"#f":5}],"c-3":["\n",{"->":"GameOver8"},{"#f":5}]}],{"#f":1}],"GameOver6":["^Il s'approche donc du braqueur, le frappe et l'assomme, mais la queue de billard se brise en deux et la seconde partie atterrie dans le hall, au pied d'un des braqueurs.","\n","^Les autres braqueurs débarquent alors et maîtrise Yuuki.","\n",{"->":"Recommencer"},{"#f":1}],"GameOver7":["^Yuuki se saisit du trophée sur l'armoire et s'approche du braqueur. Mais cet énorme trophée est trop lourd et il le fait tomber. Le criminel le remarque et neutralise Yuuki.","\n",{"->":"Recommencer"},{"#f":1}],"GameOver8":["^Verre de whisky en main, il s'approche doucement du braqueur et lui explose le verre sur le crâne. Malheureusement, il ne se fait pas assommer et crie de douleur, alertant ses partenaires. Face à un braqueur désorienté, Yuuki s'en sort, mais son collègue arrive et le capture.","\n",{"->":"Recommencer"},{"#f":1}],"BonChoix9":[["^Casque en main, il s'approche du braqueur et l'assomme d'un coup sec. En voilà un autre en moins. Il le tire alors jusqu'au bureau et le ligote, au cas où. Yuuki regarde autour de lui, il remarque plusieurs choses : Une fenêtre qu'il pourrait ouvrir, de quoi écrire et un harpon.","\n","^\"Décidément, billard, harpon de pêche, trophée de golf, on est bien dans le bureau d'un PDG.\" Se dit Yuuki.","\n","ev","str","^Yuuki ouvre la fenêtre et tire grâce au harpon un message pour la police.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Yuuki regarde au balcon pour vérifier la position des derniers braqueurs.","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n",{"->":"Fin1"},{"#f":5}],"c-1":["\n",{"->":"BonChoix10"},{"#f":5}]}],{"#f":1}],"Fin1":[["^Après avoir enroulé et attaché un papier expliquant à la police que la voie est libre et que les derniers braqueurs sont facilement appréhendables depuis le balcon, Yuuki ouvre la fenêtre et tire alors non lui d'une des voitures de police, le harpon se plantant dans le goudron. Un officier le remarque et lit le message.","\n","^Quelques minutes plus tard, voilà tout un commando qui entre par la fenêtre ouverte par Yuki et alors que certains tiennent en joue les braqueurs depuis l'étage, les autres descendent pour les arrêter.","\n","^Yuuki est un héros, il a réussi à arranger la situation. Il donnera une interview à une chaîne d'information une fois sortit de la banque et dira :","\n","^\"Oh, vous savez, je n'ai fait que mon métier. Les Rangers affrontaient des bêtes cosmiques, moi, j'affronte les petits criminels. Je fais mon devoir, c'est tout. C'est ça, être un Ranger !\"","\n","ev","str","^FINIR.","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":"FinLead"},{"#f":5}]}],{"#f":1}],"BonChoix10":[["^Les derniers braqueurs sont toujours réunis dans le hall. La voie est alors libre pour redescendre. Plusieurs options s'offrent à lui après quelques secondes de réflexion :","\n","^Attirer un à un les braqueurs et s'en débarrasser. Risqué, mais efficace.","\n","^Les attaquer frontalement. Ils sont plusieurs, hors de question.","\n","^Attendre à un endroit stratégique qu'ils fassent des rondes. Long, mais clairement le moins dangereux.","\n","^Utiliser l'arme d'un braqueur pour éliminer ceux qu'il reste. Dangereux pour Yuuki et les otages, mais efficace avec un peu de chance.","\n","ev","str","^Yuuki cherche quelque chose pour attirer un braqueur.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Yuuki cherche un endroit stratégique où se cacher.","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Yuuki récupère l'arme à feu du braqueur.","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["\n",{"->":"BonChoix11"},{"#f":5}],"c-1":["\n",{"->":"BonChoix12"},{"#f":5}],"c-2":["\n",{"->":"GameOver9"},{"#f":5}]}],{"#f":1}],"GameOver9":["^Arme en main et positionné au balcon, Yuuki se prépare à faire feu, il tire et rate, ne sachant pas se servir correctement d'une arme, les braqueurs le repère et tire en retour.","\n","^Yuuki en a trop fait, à vouloir jouer les héros, il est touché.","\n",{"->":"Recommencer"},{"#f":1}],"BonChoix11":[["^Yuuki trouve un stylo au sol, il se cache au coin d'un couloir et lance le stylo sur la porte en acier de la cage d'ascenseur. Le bruit retenti assez fort et il entend alors des pas venir dans sa direction.","\n","ev","str","^Yuuki attend que le braqueur soit dos à lui pour l'attaquer.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Yuuki l'attaque dès qu'il est à portée.","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n",{"->":"BonChoix13"},{"#f":5}],"c-1":["\n",{"->":"GameOver10"},{"#f":5}]}],{"#f":1}],"BonChoix12":[["^Yuuki regarde autour de lui à la recherche d'un endroit où se cacher pour intercepter les braqueurs en ronde. Autour de lui se trouvent plusieurs options.","\n","ev","str","^Yuuki se cache au coin d'un couloir.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Yuuki se cache dans un placard.","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Yuuki se cache sous un bureau.","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["\n",{"->":"BonChoix14"},{"#f":5}],"c-1":["\n",{"->":"BonChoix15"},{"#f":5}],"c-2":["\n",{"->":"GameOver11"},{"#f":5}]}],{"#f":1}],"GameOver10":["^Voyant le Ranger Vert sortir de sa cachette devant lui, le braquer réagit et sa crosse frappe la tête de Yuuki, le mettant hors d'état de nuire aussitôt.","\n",{"->":"Recommencer"},{"#f":1}],"GameOver11":["^Lorsque un des braqueurs finit enfin par passer devant lui, Yuuki lui saisit la jambe, mais n'arrive pas à le faire tomber, il se fait alors sortir de sa cachette et passer à tabac.","\n",{"->":"Recommencer"},{"#f":1}],"BonChoix13":[["^Une fois, le moment venu, il sort de sa cachette et l'assomme d'un coup sec. Malheureusement, le bruit de sa chute prévient le dernier braqueur qui s'approche. Yuuki doit vite se cacher de nouveau pour pouvoir le neutraliser.","\n","ev","str","^Yuuki se cache au coin du couloir.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Yuuki se cache dans le couloir précédent, entre le braqueur inconscient et son collègue.","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n",{"->":"GameOver12"},{"#f":5}],"c-1":["\n",{"->":"BonChoix16"},{"#f":5}]}],{"#f":1}],"BonChoix14":[["^Alors que le braqueur passe devant lui, Yuuki sort du placard et écrase son casque sur l'arrière de sa tête. Le voilà qui tombe au sol. Mais n'étant pas si loin du hall, cela alerte l'autre braqueur qui se rapproche.","\n","ev","str","^Yuuki se cache au coin du couloir.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Yuuki se cache dans le couloir précédent, entre le braqueur inconscient et son collègue.","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n",{"->":"GameOver12"},{"#f":5}],"c-1":["\n",{"->":"BonChoix16"},{"#f":5}]}],{"#f":1}],"BonChoix15":[["^Yuuki attend patiemment qu'un braqueur s'approche, puis soudain des pas se font entendre et alors qu'il approche, il le frappe violemment et le braqueur s'écroule. Cependant le bruit de la chute alors son collègue, qui s'approche.","\n","ev","str","^Yuuki se cache au coin du couloir.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Yuuki se cache dans le couloir précédent, entre le braqueur inconscient et son collègue.","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n",{"->":"GameOver12"},{"#f":5}],"c-1":["\n",{"->":"BonChoix16"},{"#f":5}]}],{"#f":1}],"GameOver12":["^Lorsque le dernier braqueur semble à porté, Yuuki va alors pour le frapper, mais son partenaire inconscient le gêne et le Ranger Vert rate son coup. Le braqueur peut alors le frapper à son tour et le mettre hors d'état de nuire.","\n",{"->":"Recommencer"},{"#f":1}],"BonChoix16":[["^Trop concentré sur son partenaire évanoui, le braqueur passe devant Yuuki sans le voir, lui permettant de bien l'assommer d'un coup sec de casque. Ceci fait, il l'attache.","\n","ev","str","^Yuuki se rend dans le hall et ouvre à la police.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Yuuki défait les liens aux otages puis rouvre la banque pour la police.","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n",{"->":"Fin2"},{"#f":5}],"c-1":["\n",{"->":"Fin3"},{"#f":5}]}],{"#f":1}],"Fin2":[["^Alors qu'il traverse le hall principal de la banque et déverrouille l'entrée, il sort, main en l'air, dans sa tenue de Ranger Vert et s'écrit :","\n","^\"J'ai neutralisé tous les braqueurs ! Vous pouvez entrer, les otages sont encore liés !\".","\n","^La police entre alors, arrête les criminels et libère les otages qui sont pris en charge par les secours.","\n","^Yuuki est un héros, il a réussi à arranger la situation. Il donnera une interview à une chaîne d'information une fois sortit de la banque et dira :","\n","^\"Oh, vous savez, je n'ai fait que mon métier. Les Rangers affrontaient des bêtes cosmiques, moi, j'affronte les petits criminels. Je fais mon devoir, c'est tout. C'est ça, être un Ranger !\"","\n","ev","str","^FINIR.","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":"FinLead"},{"#f":5}]}],{"#f":1}],"Fin3":[["^Les otages désormais libérés, une nuée de personnes sortent de la banque, toute bloquée par la police qui ne veut pas laisser échapper de braqueur. Yuuki se fait alors remarquer dans sa tenue de Ranger Vert et s'écrit :","\n","^\"J'ai libéré tout le monde, et les braqueurs sont tous ligotés à l'intérieur !\"","\n","^Yuuki est un héros, il a réussi à arranger la situation. Il donnera une interview à une chaîne d'information une fois sortit de la banque et dira :","\n","^\"Oh, vous savez, je n'ai fait que mon métier. Les Rangers affrontaient des bêtes cosmiques, moi, j'affronte les petits criminels. Je fais mon devoir, c'est tout. C'est ça, être un Ranger !\"","\n","ev","str","^FINIR.","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":"FinLead"},{"#f":5}]}],{"#f":1}],"Recommencer":[[["ev",{"^->":"Recommencer.0.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^GAME OVER. RECOMMENCEZ.",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Recommencer.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],"\n",{"->":"Debut"},{"#f":5}]}],{"#f":1}],"FinLead":["^BRAVO. VOUS AVEZ SAUVÉ TOUT LE MONDE SANS LE MOINDRE BLESSÉ.","\n",{"->":"Fin"},{"#f":1}],"Fin":["^Merci d'avoir joué à mon jeu et bravo pour votre réussite.","\n","^Entièrement fait par HUGO PLOUZEAU.","\n","end",{"#f":1}],"#f":1}],"listDefs":{}}